# Tap cask 
tap "homebrew/cask"

# General utilities
brew "openssl"      # Security stuff
brew "tmux"         # Split windows and saving terminal sessions (screen replacement)
brew "git"          # The latest version of git instead of Apple's older one
brew "wget"         # Mac's have curl by default, but not wget
brew "rabbitmq"     # As message queue for Celery
brew "mariadb"      # DBMS
brew "tldr"         # Nice helper overview
brew "htop"         # Process manager
brew "tree"         # For nice overview of a repo

# Programming languages
brew "python"       # Update to latest Python
brew "numpy"        # Now is Python3 only (numpy@1.16 is for python@2)
brew "go"           # Go for performant ETL jobs
brew "openjdk@11"   # need Java for Neo4j

# Python programs
brew "black"        # Python formatting
brew "flake8"       # Python styles
brew "mypy"         # Python type checking

# Core
cask "iterm2"       # A great terminal
cask "miniconda"    # Nice way to get a system Conda install
cask "sublime-merge"          # git merge tool
cask "visual-studio-code"     # Best editor

# Applications
cask "slack"
cask "spotify"
cask "teamviewer"

# Mac Application Store apps
brew "mas"
mas "Magnet", id: 441258766
mas "Dato", id: 1470584107
mas "CopyClip 2", id: 1020812363
mas "Smart-VPN", id: 1086913769
